###################################################################

# Created by write_sdc on Sat Mar 23 12:34:41 2019

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 5 [get_ports {gray[7]}]
set_load -pin_load 5 [get_ports {gray[6]}]
set_load -pin_load 5 [get_ports {gray[5]}]
set_load -pin_load 5 [get_ports {gray[4]}]
set_load -pin_load 5 [get_ports {gray[3]}]
set_load -pin_load 5 [get_ports {gray[2]}]
set_load -pin_load 5 [get_ports {gray[1]}]
set_load -pin_load 5 [get_ports {gray[0]}]
create_clock [get_ports clk]  -name CLK  -period 2.5  -waveform {0 1.25}
set_max_delay 20  -from [get_ports resetn]
set_input_delay -clock CLK  -max 0.8  [get_ports clk]
set_input_delay -clock CLK  -max 0.8  [get_ports resetn]
set_input_delay -clock CLK  -max 0.8  [get_ports {r[7]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {r[6]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {r[5]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {r[4]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {r[3]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {r[2]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {r[1]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {r[0]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b[7]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b[6]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b[5]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b[4]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b[3]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b[2]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b[1]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {b[0]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {g[7]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {g[6]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {g[5]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {g[4]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {g[3]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {g[2]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {g[1]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {g[0]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {gray[7]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {gray[6]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {gray[5]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {gray[4]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {gray[3]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {gray[2]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {gray[1]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {gray[0]}]
set_input_transition -max 1  [get_ports clk]
set_input_transition -max 1  [get_ports resetn]
set_input_transition -max 1  [get_ports {r[7]}]
set_input_transition -max 1  [get_ports {r[6]}]
set_input_transition -max 1  [get_ports {r[5]}]
set_input_transition -max 1  [get_ports {r[4]}]
set_input_transition -max 1  [get_ports {r[3]}]
set_input_transition -max 1  [get_ports {r[2]}]
set_input_transition -max 1  [get_ports {r[1]}]
set_input_transition -max 1  [get_ports {r[0]}]
set_input_transition -max 1  [get_ports {b[7]}]
set_input_transition -max 1  [get_ports {b[6]}]
set_input_transition -max 1  [get_ports {b[5]}]
set_input_transition -max 1  [get_ports {b[4]}]
set_input_transition -max 1  [get_ports {b[3]}]
set_input_transition -max 1  [get_ports {b[2]}]
set_input_transition -max 1  [get_ports {b[1]}]
set_input_transition -max 1  [get_ports {b[0]}]
set_input_transition -max 1  [get_ports {g[7]}]
set_input_transition -max 1  [get_ports {g[6]}]
set_input_transition -max 1  [get_ports {g[5]}]
set_input_transition -max 1  [get_ports {g[4]}]
set_input_transition -max 1  [get_ports {g[3]}]
set_input_transition -max 1  [get_ports {g[2]}]
set_input_transition -max 1  [get_ports {g[1]}]
set_input_transition -max 1  [get_ports {g[0]}]
